In [2]:
import pandas as pd

In [ ]:
data_dict = {'a': [1,2,3], 'b':[4,5,6]}
data_list = [{'a': 1, 'b': 4},  {'a': 2, 'b': 5}, {'a': 3, 'b': 6}]

dat = pd.DataFrame(data_dict)
dat

   a  b
0  1  4
1  2  5
2  3  6

In [6]:
dat2 = pd.DataFrame(data_list)
dat2

   a  b
0  1  4
1  2  5
2  3  6

In [7]:
dat.head(1)

   a  b
0  1  4

In [8]:
dat.tail(1)

   a  b
2  3  6

In [9]:
dat['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [11]:
dat.loc[0]

a    1
b    4
Name: 0, dtype: int64

In [12]:
dat.iloc[0]

a    1
b    4
Name: 0, dtype: int64

In [13]:
dat.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
len(dat.index)

3

In [16]:
len(dat.columns)

2

In [18]:
dat[['a','b']]

   a  b
0  1  4
1  2  5
2  3  6

In [19]:
dat[dat['a'] > 2]

   a  b
2  3  6

In [20]:
dat[dat['a'] > 2]['a']

2    3
Name: a, dtype: int64

In [ ]:
dat.write_csv()

__ASSIGNMENT__

In [6]:
import pandas as pd

In [7]:
data_dict = {'Odd': [5,7,9], 'Even':[8,10,12]}
data_list = [{'Odd': 5, 'Even': 8},  {'Odd': 7, 'Even': 10}, {'Odd': 9, 'Even': 12}]

dat = pd.DataFrame(data_dict)
dat

   Odd  Even
0    5     8
1    7    10
2    9    12

In [9]:
dat2 = pd.DataFrame(data_list)
dat2

   Odd  Even
0    5     8
1    7    10
2    9    12

In [10]:
dat.head(1)

   Odd  Even
0    5     8

In [11]:
dat.tail(1)

   Odd  Even
2    9    12

In [12]:
dat['Odd']

0    5
1    7
2    9
Name: Odd, dtype: int64

In [13]:
dat.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
len(dat.index)

3

In [15]:
len(dat.columns)

2

In [16]:
dat[['Odd','Even']]

   Odd  Even
0    5     8
1    7    10
2    9    12

In [20]:
dat[dat['Odd'] > 5]

   Odd  Even
1    7    10
2    9    12

In [21]:
dat[dat['Even'] > 8]['Even']

1    10
2    12
Name: Even, dtype: int64

In [25]:
dat.to_csv("Janke.csv")


    What does the "write/render/evaluate" loop provide for creators of interactive data visualizations?
        The "write/render/evaluate" loop provides creators a tool for quick changes/interations. In this case, when there is a lot of data, a small adjustment can take care of all the data involved. The loop can also help creators find just the right visualizations they want to use to tell their story.


    Why are dynamic, interactive data visualizations useful when communicating data?
        Interactive data visualizations are useful when communicating data because it has real-time data that can tell a story and help teams make informed decisions. It also helps that the data can be manipulated to tell the story in different ways.


    Do you agree with Murray's claim that open-source tools that avoid proprietary software are best for publishing data visualization? In a few sentences, explain why you do or do not agree.
        Yes, I agree that open-source tools are best for publishing data visualization. Different proprietary softwares are expensive and may have limited capabilities where the open-source options allow those that know the coding languages to create their own masterpiece without obstacles.